# Parameters
nc: 5  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
    l: [1.00, 1.00, 512]   

# YOLOv8 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  
  - [-1, 1, Conv, [128, 3, 2]]  
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  
  - [-1, 1, C2f_CooreA, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  
  - [-1, 1, C2f_CooreA, [512, True]]
  - [-1, 1, SPPF, [512, 5]]

# YOLOv8 head
head:

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  
  - [-1, 3, C2f, [256]] 

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  
  - [-1, 3, C2f, [128]]  

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 10, 4], 1, Concat, [1]]  
  - [-1, 3, C2f, [256]]  

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]  
  - [-1, 3, C2f, [512]]  

  - [[13, 16, 19], 1, Detect, [nc]]  # Detect(P2, P3, P4)